---
title: StructuralConnectionFailures
classe: Autodesk.Revit.DB.BuiltInFailures+StructuralConnectionFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# StructuralConnectionFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId StructuralConnectionCannotGenerate { get; }` | `StructuralConnectionFailures.StructuralConnectionCannotGenerate` | FailureDefinitionId |
| `FailureDefinitionId StructuralConnectionCannotReplaceRefs { get; }` | `StructuralConnectionFailures.StructuralConnectionCannotReplaceRefs` | FailureDefinitionId |
| `FailureDefinitionId StructuralConnectionForbiddenElementInGroup { get; }` | `StructuralConnectionFailures.StructuralConnectionForbiddenElementInGroup` | FailureDefinitionId |
| `FailureDefinitionId StructuralConnectionNoSingleRef { get; }` | `StructuralConnectionFailures.StructuralConnectionNoSingleRef` | FailureDefinitionId |
| `FailureDefinitionId StructuralConnectionNotEnoughRefs { get; }` | `StructuralConnectionFailures.StructuralConnectionNotEnoughRefs` | FailureDefinitionId |
| `FailureDefinitionId StructuralConnectionSetOfRefsChanged { get; }` | `StructuralConnectionFailures.StructuralConnectionSetOfRefsChanged` | FailureDefinitionId |
| `FailureDefinitionId StructuralConnectionTooFarNotEnoughRefs { get; }` | `StructuralConnectionFailures.StructuralConnectionTooFarNotEnoughRefs` | FailureDefinitionId |
| `FailureDefinitionId StructuralConnectionTooFarRefs { get; }` | `StructuralConnectionFailures.StructuralConnectionTooFarRefs` | FailureDefinitionId |
| `FailureDefinitionId StructuralConnectionTypeChangedToGeneric { get; }` | `StructuralConnectionFailures.StructuralConnectionTypeChangedToGeneric` | FailureDefinitionId |
| `FailureDefinitionId StructuralConnectionTypeInfoNotAvailable { get; }` | `StructuralConnectionFailures.StructuralConnectionTypeInfoNotAvailable` | FailureDefinitionId |
| `FailureDefinitionId StructuralConnectionWrongType { get; }` | `StructuralConnectionFailures.StructuralConnectionWrongType` | FailureDefinitionId |
| `FailureDefinitionId StructuralSectionHasIncompleteDefinition { get; }` | `StructuralConnectionFailures.StructuralSectionHasIncompleteDefinition` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```